---
title: Configuração Básica de um Switch Cisco Catalyst 2960.
description: Neste post, apresentamos de forma detalhada o passo a passo para efectuar uma configuração base no Switch Série 2600.
author: Celestino
date: 2024-12-12 17:57:00 +0800
categories: [Networking]
tags: [Switch, Cisco]
pin: true
image:
  path: /assets/img/post_images/devices-mockup.png
  lqip: data:image/webp;base64,UklGRpoAAABXRUJQVlA4WAoAAAAQAAAADwAABwAAQUxQSDIAAAARL0AmbZurmr57yyIiqE8oiG0bejIYEQTgqiDA9vqnsUSI6H+oAERp2HZ65qP/VIAWAFZQOCBCAAAA8AEAnQEqEAAIAAVAfCWkAALp8sF8rgRgAP7o9FDvMCkMde9PK7euH5M1m6VWoDXf2FkP3BqV0ZYbO6NA/VFIAAAA
  alt: Responsive rendering of Chirpy theme on multiple devices.
---
[![Hits](https://hits.sh/celestinopaulo.github.io.svg?style=for-the-badge&label=N%C3%BAmero%20de%20Visitas&extraCount=10)](https://hits.sh/celestinopaulo.github.io/)

## Objectivo
{: data-toc-skip='' .mt-4 .mb-0 }

Este post tem como objetivo fornecer uma orientação prática para a configuração básica de um switch Cisco Catalyst 2960. Ao final, o leitor será capaz de realizar as configurações iniciais essenciais, como definir nome do dispositivo, configurar senhas de acesso, habilitar a gestão remota via SSH e configurar interfaces básicas, garantindo assim que o switch esteja preparado para ser integrado a uma rede funcional de forma segura e eficiente.

## Público Alvo

Profissionais iniciantes em redes de computadores;
Técnicos de TI;
Estudantes de cursos relacionados à área de redes e infraestrutura;~
Entusiastas.

## Requisitos
Conhecimento básico de comandos da interface de linha de comando (CLI) do Cisco IOS.
Driver USB-to-Serial: para utilizar a conexão console.
Computador com Windows 10: Para acessar e configurar o switch via emulador de terminal.
Cabo console USB: 
Tera Term: Software de emulação de terminal para comunicação com o switch.
Switch Cisco Catalyst 2960: O equipamento a ser configurado.

## Topologia

![Desktop View](/assets/img/post_images/topologia.png){: width="972" height="589" }
_Full screen width and center alignment_

## Configurações

#### Passo 1: Resetar as configurações iniciais.
```text
Switch#delete flash:vlan
Switch#delete flash:vlan.dat
Delete filename [vlan.dat]?
Delete flash:vlan.dat? [confirm]
```
```text
Switch# delete nvram:startup-config
Delete filename [startup-config]?
Delete nvram:startup-config? [confirm]
```
#### Passo 2: Configuração de Hostname.
```text
Switch# configure terminal
Switch(config)# hostname ItLab
ItLab(config)#
```
#### Passo 3: Configuração de um endereço IP.
```text
ItLab(config)# interface vlan 1
ItLab(config-if)# ip address 192.168.0.1 255.255.255.0
ItLab(config-if)# do show ip interface brief

Interface              IP-Address      OK? Method Status                Protocol
Vlan1                  192.168.0.1     YES manual up                    down
FastEthernet0/1        unassigned      YES unset  down                  down
FastEthernet0/2        unassigned      YES unset  down                  down
....output omited....
```

### Passo 4: Configurar o Domínio
```text
ItLab(config)#ip domain-name celestinoitlab.com
```

### Passo 5: Configurar o Gateway
```text
ItLab(config)#ip default-gateway 192.168.10.1
```

### Passo 6: Configurar o DNS Server
```text
ItLab(config)#ip name-server 192.168.10.1
```

### Passo 7: Configurar uma senha no Modo Privilegiado
```text
ItLab(config)#enable secret 123
```

### Passo 8:  Configurar uma senha na Porta Console
```text
ItLab(config)# line console 0
ItLab(config-line)# password 123
ItLab(config-line)# exit
```

### Passo 9:  Habilitar o acesso remoto via SSH
```text
ItLab(config)# line console 0
ItLab(config-line)# password 123
ItLab(config-line)# exit
```

### Passo 10:  Habilitar o acesso remoto via SSH
```text
ItLab(config)#crypto key generate
% You already have RSA keys defined named ItLab.celestinoitlab.com.
% Do you really want to replace them? [yes/no]: yes
Choose the size of the key modulus in the range of 360 to 2048 for your
  General Purpose Keys. Choosing a key modulus greater than 512 may take
  a few minutes.

How many bits in the modulus [512]: 512
% Generating 512 bit RSA keys, keys will be non-exportable...[OK]

ItLab(config)# line vty 0 15
ItLab(config-line)# transport input ssh
ItLab(config-line)# login local
ItLab(config-line)# exit
ItLab(config)# username celestino privilege 15 secret 123
```
### Passo 11:  Guardar as configurações
```text
ItLab#copy running-config st
ItLab#copy running-config startup-config
Destination filename [startup-config]?
Building configuration...
```

### Passo 12:  Verificar as configurações efectuadas
```text
ItLab#show running-config
Building configuration...

Current configuration : 1590 bytes
!
version 12.2
no service pad
service timestamps debug datetime msec
service timestamps log datetime msec
no service password-encryption
!
hostname ItLab
!
boot-start-marker
boot-end-marker
!
enable secret 5 $1$K1TY$5nmIZjtNvU5BE5BCpx9/l/
!
username celestino secret 5 $1$CkF6$7KSLm3XOEQgckv2lMrznP0
no aaa new-model
system mtu routing 1500
ip subnet-zero
!
ip domain-name celestinoitlab.com
ip name-server 192.168.0.1
!
!
spanning-tree mode pvst
spanning-tree extend system-id
!
vlan internal allocation policy ascending
!
!
interface FastEthernet0/1
!
interface FastEthernet0/2
!
Omitted
!
interface FastEthernet0/24
!
interface GigabitEthernet0/1
!
interface GigabitEthernet0/2
!
interface Vlan1
 ip address 192.168.0.2 255.255.255.0
 no ip route-cache
!
ip default-gateway 192.168.0.1
ip http server
ip http secure-server
!
control-plane
!
!
line con 0
 password 123
line vty 0
 login
line vty 1
 login local
 transport input all
line vty 2 4
 login
line vty 5 15
 login
!
end
```

### Passo 13:  Configurar um endereço IP no Host(Windows 10)
![Desktop View](/assets/img/post_images/windows_ip_config.png){: width="972" height="589" }
![Desktop View](/assets/img/post_images/ipconfig.png){: width="972" height="589" }

### Passo 13:   Testar a configuração
![Desktop View](/assets/img/post_images/ping_pc_switch.png){: width="972" height="589" }
![Desktop View](/assets/img/post_images/ping_switch_pc.png){: width="972" height="589" }

### Passo 13:  Acesso Remoto via SSH
Passages, and more recently with desktop publishing software like Aldus PageMaker including versions of Lorem Ipsum.
![Desktop View](/assets/img/post_images/putty.png){: width="972" height="589" }
![Desktop View](/assets/img/post_images/ssh_con.png){: width="972" height="589" }
![Desktop View](/assets/img/post_images/ssh_switch3.png){: width="972" height="589" }

### Passo 13:  Configurar um endereço IP no Host(Windows 10)

Passages, and more recently with desktop publishing software like Aldus PageMaker including versions of Lorem Ipsum.


