---
title: ğŸš§ Conectando Sede e Filial com GRE Puro:. LaboratÃ³rio Cisco no PNETLab
description: Neste post, o objetivo Ã© demonstrar a configuraÃ§Ã£o de uma VPN Site-to-Site utilizando apenas GRE (Generic Routing Encapsulation) entre roteadores Cisco, conectando duas redes locais â€” uma na sede (HQ) e outra em uma filial (Branch).
author: Celestino
date: 2025-01-15 17:57:00 +0800
categories: [Networking]
tags: [GRE, VPN, Overlay, WAN]
pin: true
image:
  path: /assets/img/post_images/vpn/gre.png
  lqip:
  alt: 
---

## ğŸ¯Objectivos

A proposta Ã© simular um cenÃ¡rio prÃ¡tico em ambiente de laboratÃ³rio (como o PNETLab), focando no tunelamento de trÃ¡fego IP entre os sites, sem uso de criptografia (IPSec), ideal para fins de teste, simulaÃ§Ã£o de topologias e validaÃ§Ã£o de rotas entre redes separadas.

VocÃª vai aprender:

- Como configurar interfaces de tÃºnel GRE ponto a ponto.
- Como estabelecer conectividade entre redes LAN de sites distintos.
- Como roteadores intermediÃ¡rios (R2 e R3) simulam o caminho pela Internet.
- Como verificar e testar a conectividade pelo tÃºnel.

Esse tipo de configuraÃ§Ã£o Ã© Ãºtil para entender o funcionamento bÃ¡sico de tÃºneis GRE e pode servir como base para cenÃ¡rios mais avanÃ§ados com IPSec, BGP ou OSPF sobre GRE.

## ğŸ“‹Requisitos

Para acompanhar e reproduzir este laboratÃ³rio de VPN Site-to-Site com GRE em roteadores Cisco, vocÃª vai precisar de:

- ğŸ–¥ï¸ **VirtualBox** instalado (ambiente de virtualizaÃ§Ã£o).
- ğŸ§ª **PNETLab** instalado e configurado (para simular os roteadores).
- ğŸ“¦ **Imagens Cisco IOS** compatÃ­veis com interfaces de tÃºnel (por exemplo, IOSv).
- ğŸ§  **Conhecimentos bÃ¡sicos em:**, endereÃ§amento IP (IPv4), roteamento estÃ¡tico e onterface de linha de comando (CLI).

### ğŸ”§ O que Ã© GRE?

**GRE (Generic Routing Encapsulation)** Ã© um protocolo da Cisco que permite **criar tÃºneis ponto a ponto entre roteadores**. Ele encapsula pacotes IP (ou outros protocolos) para que possam ser enviados atravÃ©s de uma rede intermediÃ¡ria (como a Internet) **como se fosse um link direto**.

### ğŸ“¦ CaracterÃ­sticas principais:

- Encapsula qualquer pacote IP.
- Permite interligar redes privadas via Internet.
- Suporta protocolos de roteamento dinÃ¢mico.
- NÃ£o possui criptografia â€” pode ser combinado com IPSec para seguranÃ§a.

# ğŸ›°ï¸ ConfiguraÃ§Ã£o Completa

## ğŸ•¸ï¸ Topologia
![Desktop View](/assets/img/post_images/vpn/gre.png){: width="972" height="589" }

Temos dois locais: a **Sede (HQ)** com o roteador R1, e a **Filial (Branch)** com o roteador R4. Eles estÃ£o conectados por meio de uma rede intermediÃ¡ria simulada com os roteadores R2 e R3, representando a Internet.

Nosso objetivo Ã© estabelecer um **tÃºnel GRE entre R1 e R4**, encapsulando pacotes para que as redes locais (192.168.1.0/24 e 192.168.4.0/24) possam se comunicar como se estivessem **diretamente conectadas**.

## âš™ï¸ EndereÃ§amento IP
Inicialmene, vamos configurar os endereÃ§os IPs em todos os dispositivos e garantir a conectividade ponto-a-ponto.

### ğŸ“Œ R1
```bash
R1(config-if)# interface Ethernet0/0
R1(config-if)# ip address 10.0.0.1 255.255.255.0
R1(config-if)# no shutdown
R1(config-if)# interface Ethernet0/1
R1(config-if)# ip address 190.10.10.1 255.255.255.0
R1(config-if)# no shutdown
```

### ğŸ“Œ R2
```bash
R2(config-if)# interface Ethernet0/0
R2(config-if)# ip address 190.10.10.2 255.255.255.0
R2(config-if)# no shutdown
R2(config-if)# interface Ethernet0/3
R2(config-if)# ip address 190.20.20.1 255.255.255.0
R2(config-if)# no shutdown
```

### ğŸ“Œ R3
```bash
R3(config-if)# interface Ethernet0/3
R3(config-if)# ip address 190.20.20.1 255.255.255.0
R3(config-if)# no shutdown
R3(config-if)# interface Ethernet0/0
R3(config-if)# ip address 190.30.30.1 255.255.255.0
R3(config-if)# no shutdown
```

### ğŸ“Œ R4
```bash
R4(config-if)# interface Ethernet0/0
R4(config-if)# ip address 190.30.30.1 255.255.255.0
R4(config-if)# no shutdown
R4(config-if)# interface Ethernet0/1
R4(config-if)# ip address 20.0.0.1 255.255.255.0
R4(config-if)# no shutdown
```

## âš™ï¸ ConfiguraÃ§Ã£o do Roteamento (estatico)
A seguir, vamos configurar a roteamento estatico entre os routers (R1 ao R4) que compoem a nossa internet simulada, este roteamento visa garantir que os routers consigam alcansar uma a outra, no entanto, sem enxergarem as redes locais (HQ e Branch).

### ğŸ“Œ R1
```bash
R1(config)# ip route 190.20.20.0 255.255.255.0 Ethernet0/1
R1(config)# ip route 190.30.30.0 255.255.255.0 Ethernet0/1
```

### ğŸ“Œ R2
```bash
R2(config)# ip route 190.30.30.0 255.255.255.0 Ethernet0/3
```

### ğŸ“Œ R3
```bash
R3(config)# ip route 190.10.10.0 255.255.255.0 Ethernet0/3
```

### ğŸ“Œ R4
```bash
R4(config)# ip route 190.10.10.0 255.255.255.0 Ethernet0/1
R4(config)# ip route 190.20.20.0 255.255.255.0 Ethernet0/1
```

## ğŸ“Œ ConfiguraÃ§Ã£o do Tunnel
Agora, vamos configurar o Tunnel e o roteamento estatico entre os routers R1 e R4, essa configuracao fara com que todo trafego entre da Lan HQ para Branch seja tunelado, ou seja, que passe pelo Tunnel como se estivessem directamente conectados.

### ğŸ“Œ R1
```bash
R1(config)# interface Tunnel0
R1(config-if)#  description Tunnel para R4 Out:190.30.30.2 In:20.0.0.1
R1(config-if)# ip address 192.168.1.1 255.255.255.0
R1(config-if)# tunnel source 190.10.10.1
R1(config-if)# tunnel destination 190.30.30.2
R1(config)#  tunnel mode gre ip
R1(config)# ip route 20.0.0.0 255.255.255.0 Tunnel0
```
### ğŸ“Œ R4 - Filial (Branch)
```bash
R4(config)# interface Tunnel0
R4(config)# ip address 192.168.1.2 255.255.255.0
R4(config)# tunnel source 190.30.30.2
R4(config)# tunnel destination 190.10.10.1
R4(config)#  tunnel mode gre ip
R4(config)# ip route 10.0.0.0 255.255.255.0 Tunnel0
```

## âš™ï¸ ConfiguraÃ§Ã£o dos Hosts, Cliente na Filial e Server na Sede.
![Desktop View](/assets/img/post_images/vpn/hosts.png){: width="972" height="589" }

##  âœ…Testes e ValidaÃ§Ã£o

### âœ…Estado do Tunnel GRE
Conforme destacado o tunel esta esstabelecido.
![Desktop View](/assets/img/post_images/vpn/check1.png){: width="972" height="589" }

### âœ…Verificar a Quantidade de Hops (Saltos)
Vamos verificar a quantidade de saltos entre o cliente da Filial (Branch) para Server da Sede (HQ), conforme a imagem estamos a distÃ¢ncia 2 saltos (menos o host).

![Desktop View](/assets/img/post_images/vpn/traceroute.png){: width="972" height="589" }

No entanto, do ponto de vista do R4 ao IP do tunnel do R1, estamos a distancia de um salto.
![Desktop View](/assets/img/post_images/vpn/traceroute2.png){: width="972" height="589" }

### âœ…Teste de conectividade
![Desktop View](/assets/img/post_images/vpn/ping.png){: width="972" height="589" }

## ğŸ¥³ğŸ ConclusÃ£o

A configuraÃ§Ã£o do tÃºnel GRE foi concluÃ­da com sucesso, permitindo comunicaÃ§Ã£o entre as redes locais do HQ (R1) e da filial (R4) atravÃ©s da "internet simulada" (R2 e R3). A conectividade foi validada com sucesso. :) 